Revit 2027 API
BuiltInFailures.RoomFailures.RoomBoundaryMisalignment Property
 [Room] bounding element might be misaligned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomBoundaryMisalignment { get; }
Public Shared ReadOnly Property RoomBoundaryMisalignment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomBoundaryMisalignment {
	FailureDefinitionId^ get ();
}
static member RoomBoundaryMisalignment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace